{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp.git",
      "version": "'main'"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim.git",
      "version": "'main'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim.git"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim.git"
    },
    "fyler.nvim": {
      "src": "https://github.com/A7Lavinraj/fyler.nvim.git",
      "version": "'main'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim.git"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim.git"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim.git",
      "version": "'main'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim.git",
      "version": "'main'"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim.git",
      "version": "'main'"
    },
    "multicursor.nvim": {
      "src": "https://github.com/jake-stewart/multicursor.nvim.git",
      "version": "'1.0'"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim.git"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim.git"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig.git",
      "version": "'master'"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify.git"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter.git",
      "version": "'main'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim.git",
      "version": "'main'"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim.git",
      "version": "'main'"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim.git"
    }
  }
}
